In [ ]:
%load_ext sql
%sql mysql+mysqlconnector://blackbasil:Naveen%402193@localhost/de_project

In [3]:
%%sql
use de_project;

select * from CustomerDetails;

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
0 rows affected.
5 rows affected.

[(1, 'Alice Johnson', 'alice.johnson@example.com', '9876543210', 'Chennai'),
 (2, 'Bob Smith', 'bob.smith@example.com', '9123456789', 'Bangalore'),
 (3, 'Charlie Davis', 'charlie.davis@example.com', None, 'Delhi'),
 (4, 'Diana Evans', 'diana.evans@example.com', '9090909090', 'Mumbai'),
 (5, 'Ethan Moore', 'ethan.moore@example.com', '9000012345', 'Hyderabad')]

In [24]:
%%sql
select 
length (customer_name) as name_length,
upper(city) as city_upper,
lower(customer_name) as cust_lower,
concat(customer_name,'-',city,'-','TN') as name_c,
substring(customer_name,1,6) as name_prefix,
TRIM('  Chennai'  ) as trimmer_city,
RPAD(customer_name,15,'*') as left_padded_name,
replace(customer_name,' ','_') as updated_name,
instr(customer_name,'a') as position_of_a,
left(customer_name,5) as first_5_chars,
reverse(customer_name) as reversed_name,
format(9876543210,2) as formatted_number


from CustomerDetails;

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
5 rows affected.

[(13, 'CHENNAI', 'alice johnson', 'Alice Johnson-Chennai-TN', 'Alice ', 'Chennai', 'Alice Johnson**', 'Alice_Johnson', 1, 'Alice', 'nosnhoJ ecilA', '9,876,543,210.00'),
 (9, 'BANGALORE', 'bob smith', 'Bob Smith-Bangalore-TN', 'Bob Sm', 'Chennai', 'Bob Smith******', 'Bob_Smith', 0, 'Bob S', 'htimS boB', '9,876,543,210.00'),
 (13, 'DELHI', 'charlie davis', 'Charlie Davis-Delhi-TN', 'Charli', 'Chennai', 'Charlie Davis**', 'Charlie_Davis', 3, 'Charl', 'sivaD eilrahC', '9,876,543,210.00'),
 (11, 'MUMBAI', 'diana evans', 'Diana Evans-Mumbai-TN', 'Diana ', 'Chennai', 'Diana Evans****', 'Diana_Evans', 3, 'Diana', 'snavE anaiD', '9,876,543,210.00'),
 (11, 'HYDERABAD', 'ethan moore', 'Ethan Moore-Hyderabad-TN', 'Ethan ', 'Chennai', 'Ethan Moore****', 'Ethan_Moore', 4, 'Ethan', 'erooM nahtE', '9,876,543,210.00')]

In [27]:
%%sql

select 
length (upper(concat (customer_name,'-',city,'-','TN'))) as name_c

from CustomerDetails

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
5 rows affected.

[(24,), (22,), (22,), (21,), (24,)]